; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v1 ?v2)
             (pred_3 ?v11 ?v12)
             (pred_9 ?v1 ?v12)
             (pred_5 ?v5 ?v1 )
	     (pred_4 ?v1)
             (pred_1 ?v10)
             (pred_6 ?v11)
             (pred_11 ?v12)
             (pred_10 ?v1)
             (pred_2 ?v11)
             (pred_12 ?v1)
             (pred_7 ))



(:action op_5
:parameters (?v3 ?v13 ?v7 ?v9)
:precondition (and (pred_1 ?v3) (pred_1 ?v13) (pred_6 ?v7) (pred_11 ?v9)
          (pred_8 ?v3 ?v13) (pred_3 ?v7 ?v9)
                   (pred_9 ?v13 ?v9) (pred_4 ?v3) 
                   (pred_10 ?v13) (pred_2 ?v7))
:effect (and  (pred_12 ?v13) (not (pred_10 ?v13))))


(:action op_1
:parameters (?v3 ?v6)
:precondition (and (pred_1 ?v3) (pred_1 ?v6)
               (pred_4 ?v3) (pred_8 ?v3 ?v6) (pred_12 ?v6))
:effect (and (pred_4 ?v6) (not (pred_4 ?v3))))

(:action op_3
:parameters (?v3 ?v7)
:precondition (and (pred_1 ?v3) (pred_6 ?v7) 
                  (pred_4 ?v3) (pred_5 ?v7 ?v3) (pred_7 ))
:effect (and (pred_2 ?v7)
   (not (pred_5 ?v7 ?v3)) (not (pred_7 ))))


(:action op_4
:parameters (?v3 ?v4 ?v8)
:precondition (and (pred_1 ?v3) (pred_6 ?v4) (pred_6 ?v8)
                  (pred_4 ?v3) (pred_2 ?v8) (pred_5 ?v4 ?v3))
:effect (and (pred_2 ?v4) (pred_5 ?v8 ?v3)
        (not (pred_2 ?v8)) (not (pred_5 ?v4 ?v3))))

(:action op_2
:parameters (?v3 ?v7)
:precondition (and (pred_1 ?v3) (pred_6 ?v7) 
                  (pred_4 ?v3) (pred_2 ?v7))
:effect (and (pred_7 ) (pred_5 ?v7 ?v3) (not (pred_2 ?v7)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_05 obj_21 obj_07 obj_10 obj_18 obj_12 obj_15 obj_13 obj_09 obj_20 obj_03 obj_16 obj_01 obj_11 obj_19 obj_17
    obj_08 obj_04
    obj_02 obj_06 obj_14
    )

    (:init
       (pred_7)

       (pred_1 obj_05)
       (pred_1 obj_21)
       (pred_1 obj_07)
       (pred_1 obj_10)
       (pred_1 obj_18)
       (pred_1 obj_12)
       (pred_1 obj_15)
       (pred_1 obj_13)
       (pred_1 obj_09)
       (pred_1 obj_20)
       (pred_1 obj_03)
       (pred_1 obj_16)
       (pred_1 obj_01)
       (pred_1 obj_11)
       (pred_1 obj_19)
       (pred_1 obj_17)
       (pred_11 obj_08)
       (pred_11 obj_04)
       (pred_6 obj_02)
       (pred_6 obj_06)
       (pred_6 obj_14)

       (pred_8 obj_05 obj_18)
       (pred_8 obj_05 obj_21)
       (pred_8 obj_21 obj_12)
       (pred_8 obj_21 obj_07)
       (pred_8 obj_21 obj_05)
       (pred_8 obj_07 obj_15)
       (pred_8 obj_07 obj_10)
       (pred_8 obj_07 obj_21)
       (pred_8 obj_10 obj_13)
       (pred_8 obj_10 obj_07)
       (pred_8 obj_18 obj_09)
       (pred_8 obj_18 obj_12)
       (pred_8 obj_18 obj_05)
       (pred_8 obj_12 obj_20)
       (pred_8 obj_12 obj_15)
       (pred_8 obj_12 obj_21)
       (pred_8 obj_12 obj_18)
       (pred_8 obj_15 obj_03)
       (pred_8 obj_15 obj_13)
       (pred_8 obj_15 obj_07)
       (pred_8 obj_15 obj_12)
       (pred_8 obj_13 obj_16)
       (pred_8 obj_13 obj_10)
       (pred_8 obj_13 obj_15)
       (pred_8 obj_09 obj_01)
       (pred_8 obj_09 obj_20)
       (pred_8 obj_09 obj_18)
       (pred_8 obj_20 obj_11)
       (pred_8 obj_20 obj_03)
       (pred_8 obj_20 obj_12)
       (pred_8 obj_20 obj_09)
       (pred_8 obj_03 obj_19)
       (pred_8 obj_03 obj_16)
       (pred_8 obj_03 obj_15)
       (pred_8 obj_03 obj_20)
       (pred_8 obj_16 obj_17)
       (pred_8 obj_16 obj_13)
       (pred_8 obj_16 obj_03)
       (pred_8 obj_01 obj_11)
       (pred_8 obj_01 obj_09)
       (pred_8 obj_11 obj_19)
       (pred_8 obj_11 obj_20)
       (pred_8 obj_11 obj_01)
       (pred_8 obj_19 obj_17)
       (pred_8 obj_19 obj_03)
       (pred_8 obj_19 obj_11)
       (pred_8 obj_17 obj_16)
       (pred_8 obj_17 obj_19)
       (pred_10 obj_03)
       (pred_10 obj_11)
       (pred_10 obj_09)
       (pred_9  obj_03 obj_08)
       (pred_9  obj_11 obj_04)
       (pred_9  obj_09 obj_04)
       (pred_12 obj_05)
       (pred_12 obj_21)
       (pred_12 obj_07)
       (pred_12 obj_10)
       (pred_12 obj_18)
       (pred_12 obj_12)
       (pred_12 obj_15)
       (pred_12 obj_13)
       (pred_12 obj_20)
       (pred_12 obj_16)
       (pred_12 obj_01)
       (pred_12 obj_19)
       (pred_12 obj_17)

       (pred_3  obj_02 obj_08)
       (pred_3  obj_06 obj_04)
       (pred_3  obj_14 obj_04)
       (pred_5 obj_02 obj_07)
       (pred_5 obj_06 obj_18)
       (pred_5 obj_14 obj_13)
       (pred_4 obj_15)
    )

    (:goal (and
       (pred_5 obj_02 obj_12)
       (pred_5 obj_06 obj_12)
       (pred_5 obj_14 obj_11)
    ))
(:constraints
  (always (not (pred_4 obj_21)))
)
)

; plan
1. (op_1 obj_15 obj_13)
   deleted: (pred_4 obj_15)
   added: (pred_4 obj_13)
   goals met: 0 of 3
2. (op_3 obj_13 obj_14)
   deleted: (pred_5 obj_14 obj_13) (pred_7)
   added: (pred_2 obj_14)
   goals met: 0 of 3
3. (op_1 obj_13 obj_15)
   deleted: (pred_4 obj_13)
   added: (pred_4 obj_15)
   goals met: 0 of 3
4. (op_1 obj_15 obj_12)
   deleted: (pred_4 obj_15)
   added: (pred_4 obj_12)
   goals met: 0 of 3
5. (op_1 obj_12 obj_20)
   deleted: (pred_4 obj_12)
   added: (pred_4 obj_20)
   goals met: 0 of 3
6. (op_5 obj_20 obj_11 obj_14 obj_04)
   deleted: (pred_10 obj_11)
   added: (pred_12 obj_11)
   goals met: 0 of 3
7. (op_1 obj_20 obj_11)
   deleted: (pred_4 obj_20)
   added: (pred_4 obj_11)
   goals met: 0 of 3
8. (op_2 obj_11 obj_14)
   deleted: (pred_2 obj_14)
   added: (pred_7) (pred_5 obj_14 obj_11)
   goals met: 1 of 3
9. (op_1 obj_11 obj_20)
   deleted: (pred_4 obj_11)
   added: (pred_4 obj_20)
   goals met: 1 of 3
10. (op_1 obj_20 obj_12)
   deleted: (pred_4 obj_20)
   added: (pred_4 obj_12)
   goals met: 1 of 3
11. (op_1 obj_12 obj_18)
   deleted: (pred_4 obj_12)
   added: (pred_4 obj_18)
   goals met: 1 of 3
12. (op_3 obj_18 obj_06)
   deleted: (pred_5 obj_06 obj_18) (pred_7)
   added: (pred_2 obj_06)
   goals met: 1 of 3
13. (op_1 obj_18 obj_12)
   deleted: (pred_4 obj_18)
   added: (pred_4 obj_12)
   goals met: 1 of 3
14. (op_2 obj_12 obj_06)
   deleted: (pred_2 obj_06)
   added: (pred_7) (pred_5 obj_06 obj_12)
   goals met: 2 of 3
15. (op_1 obj_12 obj_15)
   deleted: (pred_4 obj_12)
   added: (pred_4 obj_15)
   goals met: 2 of 3
16. (op_1 obj_15 obj_07)
   deleted: (pred_4 obj_15)
   added: (pred_4 obj_07)
   goals met: 2 of 3
17. (op_3 obj_07 obj_02)
   deleted: (pred_5 obj_02 obj_07) (pred_7)
   added: (pred_2 obj_02)
   goals met: 2 of 3
18. (op_1 obj_07 obj_15)
   deleted: (pred_4 obj_07)
   added: (pred_4 obj_15)
   goals met: 2 of 3
19. (op_1 obj_15 obj_12)
   deleted: (pred_4 obj_15)
   added: (pred_4 obj_12)
   goals met: 2 of 3
20. (op_2 obj_12 obj_02)
   deleted: (pred_2 obj_02)
   added: (pred_7) (pred_5 obj_02 obj_12)
   goals met: 3 of 3
